In [36]:
import pandas as pd
import numpy as np

In [37]:
path = '/content/Ch1_Q22_V20_Data_File.xlsx'

In [38]:
df_q3_raw = pd.read_excel(path)
print(df_q3_raw.head(5))
print(df_q3_raw.shape)

    x1   x2         x3  x4  Unnamed: 4  Unnamed: 5  \
0  109  133 1957-08-27   0         NaN         NaN
1  514  577 1985-05-14   0         NaN         NaN
2  207  452 1981-02-10   1         NaN         NaN
3   87   93 1974-10-08   1         NaN         NaN
4  152  254 1971-09-16   0         NaN         NaN

                                          Unnamed: 6  Unnamed: 7  \
0                                                NaN         NaN
1                                                NaN         NaN
2  a. Subset the data set to include only observa...         NaN
3                                                NaN         NaN
4                                                NaN         NaN

                                          Unnamed: 8  Unnamed: 9 Unnamed: 10
0  The accompanying data set contains four variab...         NaN         NaN
1                                                NaN         NaN         NaN
2                                                NaN         NaN         NaN
3                                                NaN         NaN         NaN
4                                                NaN         NaN         NaN
(52, 11)

In [39]:
# Cleaning the dataset
# Selecting the necessary columns

df_q3_clean = df_q3_raw.iloc[0: ,0:4]
print(df_q3_clean.head(5), "\n")
print(df_q3_clean.shape, "\n")
print(df_q3_clean.isnull().sum())     # There are no null values)

    x1   x2         x3  x4
0  109  133 1957-08-27   0
1  514  577 1985-05-14   0
2  207  452 1981-02-10   1
3   87   93 1974-10-08   1
4  152  254 1971-09-16   0

(52, 4)

x1    0
x2    0
x3    0
x4    0
dtype: int64

In [40]:
# Checking the datatypes
df_q3_clean.dtypes

x1             int64
x2             int64
x3    datetime64[ns]
x4             int64
dtype: object

In [41]:
'''
Question a
Subset the data set to include only observations that have a date on or after May 1, 1975 for x3. How many observations are in the subset data?
'''
# Change the 'x3' column to datetime format
df_q3_clean['x3'] = pd.to_datetime(df_q3_clean['x3'])

# df_subsetA contains only the datas that are on or after May1,1975
df_subsetA = df_q3_clean.loc[df_q3_clean['x3'] >= '1975-05-1']
print("Observations in df_subset ", df_subsetA.shape[0],"\n")
print(df_subsetA)

Observations in df_subset  25

     x1   x2         x3  x4
1   514  577 1985-05-14   0
2   207  452 1981-02-10   1
5   356  348 1999-10-27   1
6   580  561 1993-03-03   0
7   158  147 1989-12-26   0
9    50   92 1982-12-17   1
10  228  232 1984-02-04   0
12  162  141 1979-01-12   0
17   41  160 1996-09-15   0
20  277  175 1994-06-22   1
22  195  170 1978-01-24   1
23  300  364 1991-02-27   0
29  569  336 1984-07-06   0
30  391  326 1989-03-27   0
31  180   99 1978-04-03   0
33  176  213 1982-04-06   0
35  107  179 1990-03-06   0
38  239  306 1984-05-08   1
39   90  168 1997-08-20   1
40  242  241 1980-03-14   1
42   56   64 1995-09-01   1
43  460  173 1983-09-15   1
45  253  145 1995-12-16   1
46  231  269 1984-05-11   0
50  235  237 1981-03-08   0

In [42]:
'''
Question b
Subset the original data set based on the binary 1/0 values for x4. How many observations are in each of the two subsets?
'''

df_zeroValues = df_q3_clean.loc[df_q3_clean['x4'] == 0]
print(df_zeroValues.head(5), "\n")
df_oneValues = df_q3_clean.loc[df_q3_clean['x4'] == 1]
print(df_oneValues.head(5), "\n")

print('Observations in 0 values for x4', df_zeroValues.shape[0])
print('Observations in 1 values for x4', df_oneValues.shape[0])

    x1   x2         x3  x4
0  109  133 1957-08-27   0
1  514  577 1985-05-14   0
4  152  254 1971-09-16   0
6  580  561 1993-03-03   0
7  158  147 1989-12-26   0

     x1   x2         x3  x4
2   207  452 1981-02-10   1
3    87   93 1974-10-08   1
5   356  348 1999-10-27   1
9    50   92 1982-12-17   1
11  386  487 1958-09-21   1

Observations in 0 values for x4 28
Observations in 1 values for x4 24